# Logistic regression Step by Step for predicting item purchase or not

##  Importing Libraries

In [1]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Importing dataset

In [2]:
dataset=pd.read_csv(r'C:\Users\ankus\OneDrive\Desktop\Naresh IT\April\28th,29th_April\Social_Network_Ads.csv')

In [3]:
dataset.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

# Variables
Response
* Purchased: purchased or not (1/0)

Explanatory
* Gender: male female
* age: age of participant

Userid is not useful we can drop it

In [10]:
dataset.drop(['User ID'],inplace=True, axis = 1)
dataset.head(1)

  Gender  Age  EstimatedSalary  Purchased
0   Male   19            19000          0

# Update some column Vlaues
gender: 1= male, 0-female

In [15]:
dataset['Gender'].replace('Female', 0, inplace=True)
dataset['Gender'].replace('Male', 1, inplace=True)
dataset.head(3)

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       0   26            43000          0

In [16]:
dataset.describe()

           Gender         Age  EstimatedSalary   Purchased
count  400.000000  400.000000       400.000000  400.000000
mean     0.490000   37.655000     69742.500000    0.357500
std      0.500526   10.482877     34096.960282    0.479864
min      0.000000   18.000000     15000.000000    0.000000
25%      0.000000   29.750000     43000.000000    0.000000
50%      0.000000   37.000000     70000.000000    0.000000
75%      1.000000   46.000000     88000.000000    1.000000
max      1.000000   60.000000    150000.000000    1.000000

In [17]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Gender           400 non-null    int64
 1   Age              400 non-null    int64
 2   EstimatedSalary  400 non-null    int64
 3   Purchased        400 non-null    int64
dtypes: int64(4)
memory usage: 12.6 KB

In [18]:
dataset.head(1)

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0

# Taking care of Missing Values and Null values

In [19]:
dataset.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

## Split the data

In [20]:
# We have to predict the HD column given the features.
X = dataset.drop(['Purchased'], axis = 1) # independent variable ( Remove mpg from X data)
y = dataset[['Purchased']] #dependent variable

In [21]:
X.head(2)

   Gender  Age  EstimatedSalary
0       1   19            19000
1       1   35            20000

In [22]:
y.head(2)

   Purchased
0          0
1          0

# Splitting Dataset- Xtrain and y Train

In [23]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(X, y, test_size=0.2,random_state=0)

# Feature Scaling for Improving model Performance

In [24]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
x_train = sc_x.fit_transform(x_train)
x_test = sc_x.transform(x_test)

# Model buidling with logistic regression model

In [25]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier.fit(x_train,y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

LogisticRegression()

# Predicting test set results

In [26]:
y_pred = classifier.predict(x_test)

# Evaluating Confusion Matrix

In [27]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test,y_pred)
print(cm)

[[56  2]
 [ 5 17]]

# Accuracy of Model

In [28]:
from sklearn.metrics import accuracy_score
ac=accuracy_score(y_test,y_pred)
print(ac)

0.9125

# Bias and Vriance

In [29]:
bias= classifier.score(x_train,y_train)
variance=classifier.score(x_test,y_test)
print(bias)
print(variance)

0.825
0.9125